<script setup lang="ts">
const customTasks = ['task9_1', 'task9_2'];
const task10 = 'task10';
</script>

<template>
  <section class="w-full bg-white rounded-[10px] mb-3 p-[30px_40px_50px_30px]">
    <VariantTaskInstruction>
      При написании развёрнутых ответов на задания 9 и 10 не искажайте авторской
      позиции, приводите конкретные примеры из текста произведений (обращайтесь
      к образам, микротемам, деталям и т.п.), не допускайте фактических и
      логических ошибок; соблюдайте нормы литературной письменной речи,
      записывайте ответы аккуратно и разборчиво (примерный объём каждого ответа
      — 5–10 предложений).
    </VariantTaskInstruction>

    <TaskInstruction>
      Выберите ОДНО из заданий: 9.1 или 9.2. Напишите прямой связный ответ:
      <ul>
        <li>— отвечая на вопрос задания, сформулируйте утверждение;</li>
        <li>— аргументируйте его;</li>
        <li>
          — приведите из стихотворения не менее ДВУХ примеров, подтверждающих
          сформулированное утверждение.
        </li>
      </ul>
    </TaskInstruction>
    <VariantTask
      v-for="taskKey in customTasks"
      :key="taskKey"
      :task-key="taskKey"
    />

    <TaskInstruction>
      Дайте аргументированный связный ответ на вопрос задания:

      <ul>
        <li>
          — выберите для сопоставления ОДНО опубликованное стихотворение,
          укажите в ответе его автора и название (не допускается обращение к
          другому произведению того автора, которому принадлежит предложенный
          текст, а также к произведениям со спорной принадлежностью к
          художественной литературе);
        </li>
        <li>— укажите сходство ИЛИ различие стихотворений;</li>
        <li>
          — приведите аргументы, подтверждающие указанное сходство/различие;
        </li>
        <li>
          — приведите из каждого стихотворения минимум по одному примеру,
          подтверждающему указанное сходство/различие;
        </li>
        <li>
          — объясните, как каждый пример подтверждает указанное
          сходство/различие.
        </li>
      </ul>
    </TaskInstruction>

    <VariantTask :task-key="task10" />
  </section>
</template>
